{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 128,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 128
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "'": 6,
      "(": 7,
      ")": 8,
      ",": 9,
      "-": 10,
      ".": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      "?": 22,
      "a": 23,
      "b": 24,
      "c": 25,
      "d": 26,
      "e": 27,
      "f": 28,
      "g": 29,
      "h": 30,
      "i": 31,
      "j": 32,
      "k": 33,
      "l": 34,
      "m": 35,
      "n": 36,
      "o": 37,
      "q": 38,
      "r": 39,
      "s": 40,
      "t": 41,
      "u": 42,
      "w": 43,
      "x": 44,
      "y": 45,
      "##s": 46,
      "##e": 47,
      "##t": 48,
      "##r": 49,
      "##a": 50,
      "##u": 51,
      "##d": 52,
      "##n": 53,
      "##h": 54,
      "##y": 55,
      "##i": 56,
      "##b": 57,
      "##q": 58,
      "##o": 59,
      "##g": 60,
      "##k": 61,
      "##l": 62,
      "##x": 63,
      "##m": 64,
      "##c": 65,
      "##w": 66,
      "##j": 67,
      "##f": 68,
      "##1": 69,
      "##0": 70,
      "##3": 71,
      "##9": 72,
      "##2": 73,
      "##5": 74,
      "##6": 75,
      "##8": 76,
      "##4": 77,
      "##7": 78,
      "##aa": 79,
      "##ad": 80,
      "##ay": 81,
      "##oo": 82,
      "##an": 83,
      "##ii": 84,
      "##ee": 85,
      "##ka": 86,
      "##ar": 87,
      "##al": 88,
      "##ha": 89,
      "##ax": 90,
      "##aan": 91,
      "ay": 92,
      "##da": 93,
      "##ada": 94,
      "ka": 95,
      "oo": 96,
      "##iy": 97,
      "ku": 98,
      "##aal": 99,
      "la": 100,
      "##ey": 101,
      "##uu": 102,
      "in": 103,
      "##in": 104,
      "##ga": 105,
      "wax": 106,
      "ah": 107,
      "##yo": 108,
      "##ta": 109,
      "##ab": 110,
      "##ir": 111,
      "iyo": 112,
      "ee": 113,
      "##id": 114,
      "##sh": 115,
      "dh": 116,
      "soo": 117,
      "##aar": 118,
      "##aas": 119,
      "##aad": 120,
      "##gu": 121,
      "##il": 122,
      "##aha": 123,
      "sh": 124,
      "ayaa": 125,
      "##am": 126,
      "uu": 127,
      "##een": 128,
      "##as": 129,
      "##adda": 130,
      "##or": 131,
      "##ag": 132,
      "is": 133,
      "dha": 134,
      "##kii": 135,
      "##ah": 136,
      "##is": 137,
      "mar": 138,
      "##eyn": 139,
      "##eeg": 140,
      "##im": 141,
      "##iga": 142,
      "kal": 143,
      "mu": 144,
      "##aab": 145,
      "##ul": 146,
      "##san": 147,
      "##ow": 148,
      "##ib": 149,
      "##eed": 150,
      "##ur": 151,
      "##oon": 152,
      "##iis": 153,
      "##tay": 154,
      "##ac": 155,
      "##aam": 156,
      "##iin": 157,
      "##maal": 158,
      "##ol": 159,
      "##el": 160,
      "si": 161,
      "##iya": 162,
      "soomaal": 163,
      "##eey": 164,
      "##ig": 165,
      "loo": 166,
      "so": 167,
      "##na": 168,
      "##eer": 169,
      "##alka": 170,
      "##ed": 171,
      "##ahay": 172,
      "mad": 173,
      "lagu": 174,
      "sha": 175,
      "sheeg": 176,
      "##ud": 177,
      "waxaa": 178,
      "##adan": 179,
      "mid": 180,
      "hor": 181,
      "##agaal": 182,
      "waa": 183,
      "war": 184,
      "madax": 185,
      "##and": 186,
      "aan": 187,
      "waxa": 188,
      "##ob": 189,
      "##iir": 190,
      "ugu": 191,
      "ar": 192,
      "had": 193,
      "##er": 194,
      "##aw": 195,
      "##eys": 196,
      "kale": 197,
      "jir": 198,
      "##to": 199,
      "##anka": 200,
      "##ash": 201,
      "dad": 202,
      "##ku": 203,
      "##ayn": 204,
      "##ub": 205,
      "##ays": 206,
      "##di": 207,
      "##weyn": 208,
      "##owl": 209,
      "##aah": 210,
      "waxaan": 211,
      "was": 212,
      "sheegay": 213,
      "soomaaliya": 214,
      "##ih": 215,
      "ma": 216,
      "##ood": 217,
      "am": 218,
      "doon": 219,
      "##aanka": 220,
      "##oob": 221,
      "sid": 222,
      "max": 223,
      "##us": 224,
      "##uur": 225,
      "##mal": 226,
      "##ooy": 227,
      "##ba": 228,
      "de": 229,
      "dowl": 230,
      "cii": 231,
      "dalka": 232,
      "badan": 233,
      "magaal": 234,
      "##aasi": 235,
      "##eel": 236,
      "##add": 237,
      "laga": 238,
      "waxay": 239,
      "##mada": 240,
      "madaxweyn": 241,
      "##dh": 242,
      "somal": 243,
      "gud": 244,
      "gob": 245,
      "##inta": 246,
      "gal": 247,
      "##af": 248,
      "##ix": 249,
      "##oor": 250,
      "qab": 251,
      "qo": 252,
      "##um": 253,
      "##la": 254,
      "##aya": 255,
      "qar": 256,
      "aad": 257,
      "inay": 258,
      "##aq": 259,
      "##day": 260,
      "xil": 261,
      "gaar": 262,
      "##aaf": 263,
      "##ayo": 264,
      "##sho": 265,
      "gobol": 266,
      "dhac": 267,
      "##aag": 268,
      "cab": 269,
      "##ex": 270,
      "##un": 271,
      "magaalada": 272,
      "bar": 273,
      "kar": 274,
      "##ux": 275,
      "##og": 276,
      "##kh": 277,
      "##oq": 278,
      "##uul": 279,
      "deg": 280,
      "##en": 281,
      "kala": 282,
      "##kan": 283,
      "il": 284,
      "##ug": 285,
      "dib": 286,
      "dar": 287,
      "iy": 288,
      "shaq": 289,
      "##ool": 290,
      "##on": 291,
      "##sha": 292,
      "al": 293,
      "af": 294,
      "##aac": 295,
      "soc": 296,
      "qaad": 297,
      "##iyay": 298,
      "##ooyin": 299,
      "qor": 300,
      "##iland": 301,
      "dal": 302,
      "kuw": 303,
      "##ti": 304,
      "wux": 305,
      "sida": 306,
      "##uud": 307,
      "hal": 308,
      "ahaa": 309,
      "maxam": 310,
      "wuxuu": 311,
      "##maan": 312,
      "muq": 313,
      "somaliland": 314,
      "far": 315,
      "tahay": 316,
      "##ooda": 317,
      "san": 318,
      "##disho": 319,
      "tal": 320,
      "maam": 321,
      "##iyo": 322,
      "##oog": 323,
      "ciida": 324,
      "##aalka": 325,
      "kul": 326,
      "##ihiin": 327,
      "##adii": 328,
      "tir": 329,
      "muqdisho": 330,
      "sam": 331,
      "shir": 332,
      "yahay": 333,
      "maamul": 334,
      "dadka": 335,
      "gar": 336,
      "wasiir": 337,
      "##se": 338,
      "dowladda": 339,
      "ad": 340,
      "door": 341,
      "##aaw": 342,
      "mud": 343,
      "qof": 344,
      "##hay": 345,
      "dhaq": 346,
      "##ana": 347,
      "##aanta": 348,
      "waxaana": 349,
      "##ida": 350,
      "##it": 351,
      "xu": 352,
      "sii": 353,
      "markii": 354,
      "lab": 355,
      "dhex": 356,
      "dagaal": 357,
      "##soo": 358,
      "wasaar": 359,
      "muu": 360,
      "bax": 361,
      "##tii": 362,
      "##iisa": 363,
      "wada": 364,
      "noq": 365,
      "sar": 366,
      "arr": 367,
      "##sa": 368,
      "##eeyay": 369,
      "uga": 370,
      "20": 371,
      "##aaq": 372,
      "##od": 373,
      "hadl": 374,
      "maal": 375,
      "##eeda": 376,
      "ab": 377,
      "##ayaa": 378,
      "##le": 379,
      "##do": 380,
      "inuu": 381,
      "##miy": 382,
      "kh": 383,
      "##adaha": 384,
      "un": 385,
      "##iinta": 386,
      "##kaan": 387,
      "##aga": 388,
      "##amb": 389,
      "xir": 390,
      "##arka": 391,
      "gobolka": 392,
      "lah": 393,
      "##kaas": 394,
      "maxamed": 395,
      "##awl": 396,
      "mas": 397,
      "##dii": 398,
      "##ma": 399,
      "maanta": 400,
      "##iyaar": 401,
      "isku": 402,
      "##ayaan": 403,
      "##eh": 404,
      "##aay": 405,
      "gudd": 406,
      "madaxweynaha": 407,
      "##ali": 408,
      "bal": 409,
      "saar": 410,
      "##ri": 411,
      "##land": 412,
      "dhin": 413,
      "sidoo": 414,
      "##sad": 415,
      "##iyey": 416,
      "xas": 417,
      "##lam": 418,
      "du": 419,
      "yihiin": 420,
      "##abka": 421,
      "##idh": 422,
      "bil": 423,
      "##iyeed": 424,
      "##ooyinka": 425,
      "dhaw": 426,
      "ciidamada": 427,
      "dhig": 428,
      "baar": 429,
      "##sta": 430,
      "siy": 431,
      "ahaan": 432,
      "##ayd": 433,
      "##aaj": 434,
      "hel": 435,
      "##yada": 436,
      "shar": 437,
      "koo": 438,
      "##uum": 439,
      "doorash": 440,
      "##tland": 441,
      "hore": 442,
      "aq": 443,
      "untland": 444,
      "shac": 445,
      "##taa": 446,
      "##iid": 447,
      "damb": 448,
      "ayuu": 449,
      "dhal": 450,
      "gol": 451,
      "##aasha": 452,
      "##ihii": 453,
      "shab": 454,
      "##ia": 455,
      "wal": 456,
      "##gac": 457,
      "##oomiy": 458,
      "##aat": 459,
      "dil": 460,
      "##ic": 461,
      "wa": 462,
      "##kaasi": 463,
      "deeg": 464,
      "##om": 465,
      "magac": 466,
      "wad": 467,
      "##ayb": 468,
      "##iiska": 469,
      "##imaha": 470,
      "xar": 471,
      "cus": 472,
      "##si": 473,
      "tirsan": 474,
      "dhacay": 475,
      "leh": 476,
      "##iil": 477,
      "taag": 478,
      "ama": 479,
      "ciid": 480,
      "madaxweyne": 481,
      "car": 482,
      "##aadka": 483,
      "ra": 484,
      "hoo": 485,
      "soomaaliyeed": 486,
      "qaar": 487,
      "marka": 488,
      "##abad": 489,
      "##eysa": 490,
      "##abab": 491,
      "##no": 492,
      "##aakii": 493,
      "qayb": 494,
      "siyaas": 495,
      "an": 496,
      "looga": 497,
      "dham": 498,
      "cabd": 499,
      "##mo": 500,
      "##uun": 501,
      "hay": 502,
      "##dhib": 503,
      "maamulka": 504,
      "dawl": 505,
      "og": 506,
      "##med": 507,
      "yar": 508,
      "##eyb": 509,
      "xildhib": 510,
      "##alay": 511,
      "##ya": 512,
      "fur": 513,
      "ax": 514,
      "weer": 515,
      "loogu": 516,
      "he": 517,
      "weyn": 518,
      "##imada": 519,
      "##aash": 520,
      "koox": 521,
      "nin": 522,
      "fed": 523,
      "xuk": 524,
      "##taan": 525,
      "qeyb": 526,
      "dhis": 527,
      "feder": 528,
      "##shay": 529,
      "xildhibaan": 530,
      "hadlay": 531,
      "ban": 532,
      "dhinac": 533,
      "kor": 534,
      "bix": 535,
      "##kiisa": 536,
      "cusub": 537,
      "##umar": 538,
      "isla": 539,
      "shee": 540,
      "iyad": 541,
      "baah": 542,
      "bad": 543,
      "dhow": 544,
      "golaha": 545,
      "dan": 546,
      "201": 547,
      "##iyada": 548,
      "bul": 549,
      "##ish": 550,
      "##eenka": 551,
      "cabdi": 552,
      "go": 553,
      "shacabka": 554,
      "cad": 555,
      "##iim": 556,
      "sug": 557,
      "##lin": 558,
      "diyaar": 559,
      "xis": 560,
      "shabaab": 561,
      "as": 562,
      "cali": 563,
      "meel": 564,
      "##eeyey": 565,
      "##imo": 566,
      "kuwa": 567,
      "joog": 568,
      "##gal": 569,
      "ken": 570,
      "##shada": 571,
      "xasan": 572,
      "caas": 573,
      "yir": 574,
      "im": 575,
      "sal": 576,
      "hog": 577,
      "baarlam": 578,
      "##iyadda": 579,
      "wasiirka": 580,
      "##siga": 581,
      "kad": 582,
      "##wan": 583,
      "id": 584,
      "##tan": 585,
      "weerar": 586,
      "warb": 587,
      "har": 588,
      "inta": 589,
      "##aada": 590,
      "##ilm": 591,
      "##aysa": 592,
      "axmed": 593,
      "##kanka": 594,
      "it": 595,
      "leey": 596,
      "aw": 597,
      "##naa": 598,
      "guud": 599,
      "##iyaha": 600,
      "kenya": 601,
      "federaalka": 602,
      "mac": 603,
      "##agoo": 604,
      "##kaana": 605,
      "xukuum": 606,
      "xus": 607,
      "hab": 608,
      "##eeyo": 609,
      "muuq": 610,
      "lahaa": 611,
      "##iib": 612,
      "##ayay": 613,
      "haddii": 614,
      "gu": 615,
      "gan": 616,
      "hesh": 617,
      "labada": 618,
      "iyadoo": 619,
      "##teen": 620,
      "guddoomiy": 621,
      "xaf": 622,
      "##mad": 623,
      "kadib": 624,
      "dhib": 625,
      "qal": 626,
      "goob": 627,
      "##ane": 628,
      "caal": 629,
      "dheer": 630,
      "dhan": 631,
      "xub": 632,
      "arrimaha": 633,
      "jira": 634,
      "sabab": 635,
      "gac": 636,
      "cod": 637,
      "kasta": 638,
      "xaq": 639,
      "gur": 640,
      "xig": 641,
      "##eyso": 642,
      "gaad": 643,
      "yiri": 644,
      "##eedka": 645,
      "caalam": 646,
      "masuul": 647,
      "itoob": 648,
      "na": 649,
      "dab": 650,
      "##aale": 651,
      "##st": 652,
      "##at": 653,
      "##ro": 654,
      "xisb": 655,
      "##re": 656,
      "##may": 657,
      "duwan": 658,
      "sax": 659,
      "qarax": 660,
      "hadda": 661,
      "guul": 662,
      "doono": 663,
      "##iyaan": 664,
      "hadal": 665,
      "##isay": 666,
      "##eeya": 667,
      "##daha": 668,
      "##uuq": 669,
      "taas": 670,
      "xoog": 671,
      "ur": 672,
      "sanad": 673,
      "sidii": 674,
      "xaal": 675,
      "##eg": 676,
      "##ayso": 677,
      "waan": 678,
      "haw": 679,
      "ciidanka": 680,
      "##adeed": 681,
      "itoobiya": 682,
      "baarlamaanka": 683,
      "jeed": 684,
      "##lada": 685,
      "##anta": 686,
      "kasoo": 687,
      "##adu": 688,
      "qaaday": 689,
      "##iska": 690,
      "afri": 691,
      "##bar": 692,
      "sare": 693,
      "xiriir": 694,
      "kulan": 695,
      "ganac": 696,
      "keen": 697,
      "iska": 698,
      "##aayo": 699,
      "##eyd": 700,
      "saf": 701,
      "##aalaha": 702,
      "yim": 703,
      "amn": 704,
      "gel": 705,
      "baxay": 706,
      "ha": 707,
      "##aabo": 708,
      "bulshada": 709,
      "##uq": 710,
      "degmada": 711,
      "int": 712,
      "tag": 713,
      "howl": 714,
      "##eesh": 715,
      "isu": 716,
      "isaga": 717,
      "##eb": 718,
      "##adh": 719,
      "##kaa": 720,
      "wasaaradda": 721,
      "kam": 722,
      "##ashada": 723,
      "maq": 724,
      "lac": 725,
      "##eysan": 726,
      "dir": 727,
      "bur": 728,
      "##kooda": 729,
      "sheekh": 730,
      "sharc": 731,
      "gab": 732,
      "kha": 733,
      "jiray": 734,
      "balse": 735,
      "yidh": 736,
      "##aax": 737,
      "##uf": 738,
      "##00": 739,
      "##uus": 740,
      "##iix": 741,
      "aqoon": 742,
      "urur": 743,
      "##aajo": 744,
      "xarun": 745,
      "muh": 746,
      "##uh": 747,
      "on": 748,
      "##uux": 749,
      "maray": 750,
      "ilaa": 751,
      "wan": 752,
      "nool": 753,
      "qaab": 754,
      "##aabay": 755,
      "##yar": 756,
      "##ij": 757,
      "reer": 758,
      "##saday": 759,
      "##aakiin": 760,
      "ahayd": 761,
      "waq": 762,
      "deegaanka": 763,
      "raiis": 764,
      "##eesha": 765,
      "taageer": 766,
      "##iyeen": 767,
      "socda": 768,
      "aadan": 769,
      "farm": 770,
      "doorashada": 771,
      "##adka": 772,
      "##ahan": 773,
      "##eeb": 774,
      "19": 775,
      "noqon": 776,
      "##dob": 777,
      "##jin": 778,
      "hub": 779,
      "##fur": 780,
      "ayaan": 781,
      "laakiin": 782,
      "dhag": 783,
      "farmaajo": 784,
      "##maha": 785,
      "lacag": 786,
      "noo": 787,
      "##lo": 788,
      "qaranka": 789,
      "tar": 790,
      "markaana": 791,
      "nabad": 792,
      "##ec": 793,
      "xukuumadda": 794,
      "##aado": 795,
      "bool": 796,
      "tan": 797,
      "dhaaw": 798,
      "kamid": 799,
      "##oos": 800,
      "##ado": 801,
      "han": 802,
      "mudane": 803,
      "wel": 804,
      "koob": 805,
      "galay": 806,
      "caaf": 807,
      "##aahi": 808,
      "dhul": 809,
      "##kar": 810,
      "jaw": 811,
      "cid": 812,
      "marey": 813,
      "arrin": 814,
      "er": 815,
      "caafim": 816,
      "##madda": 817,
      "kaga": 818,
      "harg": 819,
      "dhaawac": 820,
      "##if": 821,
      "##eysay": 822,
      "baaq": 823,
      "boq": 824,
      "##ees": 825,
      "jam": 826,
      "mil": 827,
      "laba": 828,
      "xog": 829,
      "##iic": 830,
      "adeeg": 831,
      "karo": 832,
      "sheegtay": 833,
      "amniga": 834,
      "ciyaar": 835,
      "##awir": 836,
      "wanaag": 837,
      "##sii": 838,
      "##iso": 839,
      "##eynta": 840,
      "somalia": 841,
      "##ilmaam": 842,
      "##iye": 843,
      "rab": 844,
      "##nu": 845,
      "wadd": 846,
      "##aadir": 847,
      "##oonka": 848,
      "leeyahay": 849,
      "xaqii": 850,
      "daaw": 851,
      "dhanka": 852,
      "isb": 853,
      "xill": 854,
      "##kood": 855,
      "deegaan": 856,
      "madaxda": 857,
      "##igii": 858,
      "aysan": 859,
      "##gan": 860,
      "mus": 861,
      "fil": 862,
      "heshiis": 863,
      "kii": 864,
      "mur": 865,
      "maalin": 866,
      "mal": 867,
      "##asho": 868,
      "muhiim": 869,
      "halka": 870,
      "##yay": 871,
      "mah": 872,
      "afrika": 873,
      "##tir": 874,
      "xarunta": 875,
      "dowlad": 876,
      "ras": 877,
      "gudb": 878,
      "##mi": 879,
      "##mud": 880,
      "yidhi": 881,
      "sawir": 882,
      "gudaha": 883,
      "##gel": 884,
      "onlin": 885,
      "##ast": 886,
      "masuuliy": 887,
      "doonaan": 888,
      "##et": 889,
      "shirk": 890,
      "qaa": 891,
      "tur": 892,
      "yaal": 893,
      "##es": 894,
      "ark": 895,
      "baahan": 896,
      "mareykanka": 897,
      "##ista": 898,
      "##jir": 899,
      "##mar": 900,
      "jab": 901,
      "ayay": 902,
      "guddoomiyaha": 903,
      "##atay": 904,
      "dhinaca": 905,
      "raiisul": 906,
      "dii": 907,
      "dhax": 908,
      "cel": 909,
      "##mudug": 910,
      "galmudug": 911,
      "kula": 912,
      "##uhu": 913,
      "maxka": 914,
      "inaan": 915,
      "joo": 916,
      "xidh": 917,
      "##io": 918,
      "tilmaam": 919,
      "eed": 920,
      "isl": 921,
      "##ak": 922,
      "isagoo": 923,
      "muddo": 924,
      "yeel": 925,
      "cul": 926,
      "sano": 927,
      "kuwaas": 928,
      "dawladda": 929,
      "##iikh": 930,
      "##aayeen": 931,
      "##tu": 932,
      "hoose": 933,
      "hogg": 934,
      "wararka": 935,
      "waxy": 936,
      "koon": 937,
      "su": 938,
      "jub": 939,
      "##ber": 940,
      "ilaal": 941,
      "dilay": 942,
      "qaran": 943,
      "##naan": 944,
      "arag": 945,
      "##uunka": 946,
      "dhaaf": 947,
      "hoos": 948,
      "soomaalida": 949,
      "fal": 950,
      "##daan": 951,
      "##em": 952,
      "qur": 953,
      "hir": 954,
      "##nay": 955,
      "##aaday": 956,
      "hawl": 957,
      "wareeg": 958,
      "##ixii": 959,
      "maxamuud": 960,
      "##inka": 961,
      "##ys": 962,
      "xan": 963,
      "##dha": 964,
      "xal": 965,
      "##tic": 966,
      "da": 967,
      "dhexe": 968,
      "hargeysa": 969,
      "shirka": 970,
      "horumar": 971,
      "qorsh": 972,
      "kooxda": 973,
      "xisbiga": 974,
      "caasimada": 975,
      "warbix": 976,
      "nol": 977,
      "xubn": 978,
      "online": 979,
      "saraakii": 980,
      "xafiiska": 981,
      "aanu": 982,
      "##laahi": 983,
      "com": 984,
      "caasim": 985,
      "ag": 986,
      "ful": 987,
      "waxayna": 988,
      "bish": 989,
      "##ayaasha": 990,
      "dagaalka": 991,
      "##ik": 992,
      "qaban": 993,
      "wasaaraha": 994,
      "wanaagsan": 995,
      "jaam": 996,
      "koonfur": 997,
      "cabdul": 998,
      "cumar": 999,
      "galb": 1000,
      "##aabsan": 1001,
      "xuku": 1002,
      "sann": 1003,
      "##uuc": 1004,
      "##addu": 1005,
      "wixii": 1006,
      "##bal": 1007,
      "turk": 1008,
      "saam": 1009,
      "sugan": 1010,
      "xigeenka": 1011,
      "##tooy": 1012,
      "dhim": 1013,
      "add": 1014,
      "muuse": 1015,
      "qabtay": 1016,
      "mahad": 1017,
      "qodob": 1018,
      "##agu": 1019,
      "##aysay": 1020,
      "sadd": 1021,
      "eeg": 1022,
      "jaamac": 1023,
      "waxbar": 1024,
      "warbaah": 1025,
      "saabsan": 1026,
      "hada": 1027,
      "islaam": 1028,
      "soco": 1029,
      "sheegeen": 1030,
      "taar": 1031,
      "mush": 1032,
      "##nimo": 1033,
      "##ina": 1034,
      "saddex": 1035,
      "##eystay": 1036,
      "caalamka": 1037,
      "##amada": 1038,
      "dowlada": 1039,
      "dhashay": 1040,
      "xeer": 1041,
      "dhammaan": 1042,
      "dhigay": 1043,
      "xab": 1044,
      "barn": 1045,
      "guddiga": 1046,
      "fadh": 1047,
      "##uurka": 1048,
      "iyada": 1049,
      "noqo": 1050,
      "##andh": 1051,
      "jiraan": 1052,
      "raac": 1053,
      "ber": 1054,
      "qoraal": 1055,
      "##aaraha": 1056,
      "##gag": 1057,
      "##aynta": 1058,
      "dul": 1059,
      "##inayo": 1060,
      "way": 1061,
      "kusoo": 1062,
      "##owga": 1063,
      "##uub": 1064,
      "danb": 1065,
      "##aamij": 1066,
      "ada": 1067,
      "isugu": 1068,
      "kac": 1069,
      "wuxuuna": 1070,
      "saaray": 1071,
      "goaan": 1072,
      "##igu": 1073,
      "jamh": 1074,
      "kaas": 1075,
      "awood": 1076,
      "cadd": 1077,
      "##aadh": 1078,
      "##tar": 1079,
      "##aba": 1080,
      "##yeen": 1081,
      "walba": 1082,
      "xilka": 1083,
      "##tada": 1084,
      "ahayn": 1085,
      "wadan": 1086,
      "dhaqan": 1087,
      "daawo": 1088,
      "gaaray": 1089,
      "##ala": 1090,
      "taariikh": 1091,
      "dhalin": 1092,
      "barnaamij": 1093,
      "jamhuur": 1094,
      "##eeyaan": 1095,
      "doonaa": 1096,
      "##aqaan": 1097,
      "geer": 1098,
      "cun": 1099,
      "caaw": 1100,
      "##ilaaf": 1101,
      "shalay": 1102,
      "dast": 1103,
      "gudoomiy": 1104,
      "maad": 1105,
      "cas": 1106,
      "bed": 1107,
      "warbaahinta": 1108,
      "booliska": 1109,
      "##iif": 1110,
      "aanay": 1111,
      "heer": 1112,
      "xoo": 1113,
      "##th": 1114,
      "##ani": 1115,
      "##oow": 1116,
      "##nada": 1117,
      "##aysan": 1118,
      "adag": 1119,
      "suur": 1120,
      "gaadh": 1121,
      "laa": 1122,
      "##adiisa": 1123,
      "##yey": 1124,
      "##aysaa": 1125,
      "khilaaf": 1126,
      "qofka": 1127,
      "halkaas": 1128,
      "hoggaam": 1129,
      "dhibaat": 1130,
      "cabdir": 1131,
      "qoys": 1132,
      "boo": 1133,
      "sannad": 1134,
      "##aama": 1135,
      "dhowr": 1136,
      "akh": 1137,
      "aam": 1138,
      "qaadan": 1139,
      "istic": 1140,
      "nab": 1141,
      "weli": 1142,
      "##tiga": 1143,
      "##bo": 1144,
      "jiro": 1145,
      "##waad": 1146,
      "cal": 1147,
      "rag": 1148,
      "##ayey": 1149,
      "buu": 1150,
      "midoob": 1151,
      "wiil": 1152,
      "tod": 1153,
      "##eeyeen": 1154,
      "##yan": 1155,
      "bandh": 1156,
      "taagan": 1157,
      "jar": 1158,
      "##eedahay": 1159,
      "beel": 1160,
      "qaatay": 1161,
      "##axmaan": 1162,
      "sac": 1163,
      "##ra": 1164,
      "##keeda": 1165,
      "aas": 1166,
      "warar": 1167,
      "horr": 1168,
      "leedahay": 1169,
      "maraykanka": 1170,
      "isk": 1171,
      "day": 1172,
      "##lan": 1173,
      "##nimada": 1174,
      "##tooyada": 1175,
      "karin": 1176,
      "gacanta": 1177,
      "khas": 1178,
      "sidaas": 1179,
      "faah": 1180,
      "##iba": 1181,
      "mash": 1182,
      "dhamaan": 1183,
      "gacan": 1184,
      "##ot": 1185,
      "doona": 1186,
      "bandhig": 1187,
      "shaqo": 1188,
      "dalalka": 1189,
      "kordh": 1190,
      "nooc": 1191,
      "##iyad": 1192,
      "beesha": 1193,
      "biix": 1194,
      "faa": 1195,
      "waxaanu": 1196,
      "waxaad": 1197,
      "dhalinyar": 1198,
      "guur": 1199,
      "##so": 1200,
      "jirto": 1201,
      "turkiga": 1202,
      "dadkii": 1203,
      "##maanka": 1204,
      "siyaasadeed": 1205,
      "hayadda": 1206,
      "banaadir": 1207,
      "waana": 1208,
      "isticmaal": 1209,
      "##idda": 1210,
      "shaac": 1211,
      "wakii": 1212,
      "tilmaamay": 1213,
      "dhawaan": 1214,
      "carab": 1215,
      "cud": 1216,
      "biixi": 1217,
      "laab": 1218,
      "##lim": 1219,
      "xuseen": 1220,
      "socday": 1221,
      "##aj": 1222,
      "waayo": 1223,
      "kuwo": 1224,
      "##tiisa": 1225,
      "##gaar": 1226,
      "yimid": 1227,
      "##ew": 1228,
      "maalm": 1229,
      "10": 1230,
      "##shab": 1231,
      "##ef": 1232,
      "##addii": 1233,
      "galbeed": 1234,
      "##aynaa": 1235,
      "ilaah": 1236,
      "##idka": 1237,
      "islam": 1238,
      "halkan": 1239,
      "xildhibaanada": 1240,
      "ciidan": 1241,
      "labaad": 1242,
      "tabab": 1243,
      "abuur": 1244,
      "ill": 1245,
      "dhawaaq": 1246,
      "goboleed": 1247,
      "socd": 1248,
      "naf": 1249,
      "hogaam": 1250,
      "##jeed": 1251,
      "fiic": 1252,
      "##bad": 1253,
      "kooban": 1254,
      "##jiyay": 1255,
      "mushar": 1256,
      "jirin": 1257,
      "bog": 1258,
      "afar": 1259,
      "##eex": 1260,
      "muc": 1261,
      "jec": 1262,
      "##keen": 1263,
      "nolo": 1264,
      "ammaanka": 1265,
      "tall": 1266,
      "##waan": 1267,
      "xor": 1268,
      "waf": 1269,
      "soomaali": 1270,
      "leeyihiin": 1271,
      "##tid": 1272,
      "caafimaadka": 1273,
      "##iiraan": 1274,
      "booq": 1275,
      "boqor": 1276,
      "ururka": 1277,
      "aynu": 1278,
      "kan": 1279,
      "##iyiinta": 1280,
      "iyaga": 1281,
      "hadd": 1282,
      "jamhuuriyadda": 1283,
      "wasaare": 1284,
      "dun": 1285,
      "dhaqaalaha": 1286,
      "##adood": 1287,
      "xalay": 1288,
      "maxaa": 1289,
      "xum": 1290,
      "##amar": 1291,
      "warbixin": 1292,
      "roob": 1293,
      "##rada": 1294,
      "xiis": 1295,
      "beeg": 1296,
      "doorashooyinka": 1297,
      "yeesh": 1298,
      "##iiq": 1299,
      "cudur": 1300,
      "taliyaha": 1301,
      "inaad": 1302,
      "qaramada": 1303,
      "##dhig": 1304,
      "xubnaha": 1305,
      "dhab": 1306,
      "um": 1307,
      "taal": 1308,
      "dhulka": 1309,
      "noqday": 1310,
      "duq": 1311,
      "ciidamo": 1312,
      "##itaan": 1313,
      "taasi": 1314,
      "dig": 1315,
      "lahayn": 1316,
      "waj": 1317,
      "hays": 1318,
      "islamar": 1319,
      "gees": 1320,
      "##taas": 1321,
      "dhacday": 1322,
      "aqalka": 1323,
      "mark": 1324,
      "##aaga": 1325,
      "sameeyay": 1326,
      "helay": 1327,
      "saac": 1328,
      "##soon": 1329,
      "duul": 1330,
      "maadaama": 1331,
      "kur": 1332,
      "tim": 1333,
      "akhr": 1334,
      "cir": 1335,
      "kaal": 1336,
      "##isom": 1337,
      "##yahay": 1338,
      "shaqaalaha": 1339,
      "##bur": 1340,
      "yaqaan": 1341,
      "##ter": 1342,
      "##iisu": 1343,
      "muuqaal": 1344,
      "jawaab": 1345,
      "agaas": 1346,
      "ula": 1347,
      "markaas": 1348,
      "bishii": 1349,
      "kulanka": 1350,
      "amisom": 1351,
      "buux": 1352,
      "garoonka": 1353,
      "##itaanka": 1354,
      "siin": 1355,
      "intii": 1356,
      "##ran": 1357,
      "midowga": 1358,
      "##aatan": 1359,
      "##laha": 1360,
      "sanadkii": 1361,
      "nax": 1362,
      "col": 1363,
      "dhaafay": 1364,
      "##li": 1365,
      "##adooda": 1366,
      "tac": 1367,
      "##yaan": 1368,
      "##ayeen": 1369,
      "##adaas": 1370,
      "##20": 1371,
      "halkaasi": 1372,
      "dood": 1373,
      "##umarka": 1374,
      "siyaasadda": 1375,
      "th": 1376,
      "imaar": 1377,
      "##sam": 1378,
      "raad": 1379,
      "dastuurka": 1380,
      "iib": 1381,
      "##tida": 1382,
      "##man": 1383,
      "xaaf": 1384,
      "iyagoo": 1385,
      "magacaabay": 1386,
      "dhintay": 1387,
      "meesha": 1388,
      "daray": 1389,
      "doonto": 1390,
      "labo": 1391,
      "caasimadda": 1392,
      "##weyne": 1393,
      "yur": 1394,
      "##iidh": 1395,
      "##oona": 1396,
      "uusan": 1397,
      "saax": 1398,
      "maar": 1399,
      "xaaj": 1400,
      "##co": 1401,
      "baaqay": 1402,
      "bilaab": 1403,
      "##ism": 1404,
      "dac": 1405,
      "jirta": 1406,
      "yurub": 1407,
      "##wayn": 1408,
      "ing": 1409,
      "muslim": 1410,
      "jubbal": 1411,
      "ayey": 1412,
      "dhic": 1413,
      "mun": 1414,
      "tr": 1415,
      "xul": 1416,
      "raj": 1417,
      "##uurta": 1418,
      "##ing": 1419,
      "sababta": 1420,
      "##tee": 1421,
      "##isa": 1422,
      "hadii": 1423,
      "fiican": 1424,
      "jubbaland": 1425,
      "kaliya": 1426,
      "hiiraan": 1427,
      "ib": 1428,
      "kalena": 1429,
      "alle": 1430,
      "has": 1431,
      "dr": 1432,
      "##eeye": 1433,
      "##shaha": 1434,
      "##kaal": 1435,
      "ruux": 1436,
      "dhismaha": 1437,
      "sheegaya": 1438,
      "geeriy": 1439,
      "kel": 1440,
      "caafimaad": 1441,
      "lasoo": 1442,
      "xad": 1443,
      "dibadda": 1444,
      "baa": 1445,
      "shaqada": 1446,
      "howlgal": 1447,
      "dambe": 1448,
      "##atar": 1449,
      "madaxtooyada": 1450,
      "shabeel": 1451,
      "xukun": 1452,
      "cilm": 1453,
      "dhaqanka": 1454,
      "xag": 1455,
      "tus": 1456,
      "##ban": 1457,
      "gaadiid": 1458,
      "dif": 1459,
      "##igan": 1460,
      "khey": 1461,
      "cay": 1462,
      "dadaal": 1463,
      "boqol": 1464,
      "qaada": 1465,
      "arday": 1466,
      "##har": 1467,
      "waxbarashada": 1468,
      "karaan": 1469,
      "beer": 1470,
      "midoobay": 1471,
      "cabdullaahi": 1472,
      "islamarkaana": 1473,
      "nid": 1474,
      "jan": 1475,
      "##dan": 1476,
      "##adaasi": 1477,
      "mucaar": 1478,
      "burbur": 1479,
      "##aato": 1480,
      "saxaaf": 1481,
      "lahaayeen": 1482,
      "sharci": 1483,
      "##uuti": 1484,
      "difaac": 1485,
      "ayna": 1486,
      "##uush": 1487,
      "marx": 1488,
      "##jib": 1489,
      "##iirka": 1490,
      "lala": 1491,
      "nidaam": 1492,
      "shacab": 1493,
      "khal": 1494,
      "qiim": 1495,
      "daah": 1496,
      "yaab": 1497,
      "bixin": 1498,
      "dug": 1499,
      "##sado": 1500,
      "##laan": 1501,
      "been": 1502,
      "waqooy": 1503,
      "yuus": 1504,
      "tababar": 1505,
      "suuq": 1506,
      "maxkamadda": 1507,
      "wakh": 1508,
      "##ata": 1509,
      "##aka": 1510,
      "qaat": 1511,
      "sidaa": 1512,
      "oday": 1513,
      "mag": 1514,
      "dhaqaale": 1515,
      "##aare": 1516,
      "dunida": 1517,
      "yuusuf": 1518,
      "##iig": 1519,
      "adk": 1520,
      "##una": 1521,
      "inka": 1522,
      "dhamm": 1523,
      "carr": 1524,
      "yee": 1525,
      "dek": 1526,
      "waxyaab": 1527,
      "kism": 1528,
      "ingir": 1529,
      "saraakiisha": 1530,
      "200": 1531,
      "##cyo": 1532,
      "##ato": 1533,
      "waree": 1534,
      "jabuuti": 1535,
      "ol": 1536,
      "sharciga": 1537,
      "##teed": 1538,
      "dambeeyay": 1539,
      "xaaladda": 1540,
      "##tey": 1541,
      "goboleedyada": 1542,
      "idaac": 1543,
      "guddoomiye": 1544,
      "masuuliyiin": 1545,
      "##tooda": 1546,
      "##isha": 1547,
      "xid": 1548,
      "macal": 1549,
      "kismaayo": 1550,
      "gudoomiyaha": 1551,
      "qaarkood": 1552,
      "xuq": 1553,
      "##ooday": 1554,
      "argag": 1555,
      "##gar": 1556,
      "dee": 1557,
      "kara": 1558,
      "iney": 1559,
      "qaabil": 1560,
      "##han": 1561,
      "aamin": 1562,
      "##miye": 1563,
      "##cel": 1564,
      "qax": 1565,
      "diray": 1566,
      "caq": 1567,
      "##uudiga": 1568,
      "badb": 1569,
      "##min": 1570,
      "caad": 1571,
      "xilli": 1572,
      "qaado": 1573,
      "kama": 1574,
      "gabad": 1575,
      "ii": 1576,
      "waxba": 1577,
      "##edda": 1578,
      "##ca": 1579,
      "##yahan": 1580,
      "15": 1581,
      "shan": 1582,
      "xool": 1583,
      "habeen": 1584,
      "xun": 1585,
      "gaalka": 1586,
      "karaa": 1587,
      "berber": 1588,
      "xubno": 1589,
      "munaas": 1590,
      "xuquuq": 1591,
      "##taag": 1592,
      "diid": 1593,
      "##anaya": 1594,
      "badda": 1595,
      "dam": 1596,
      "##ch": 1597,
      "imaan": 1598,
      "dhageyso": 1599,
      "ism": 1600,
      "##obi": 1601,
      "diyaaradaha": 1602,
      "##inaya": 1603,
      "intaas": 1604,
      "horay": 1605,
      "kadd": 1606,
      "##os": 1607,
      "##iq": 1608,
      "2018": 1609,
      "culus": 1610,
      "##gii": 1611,
      "caalamiga": 1612,
      "ray": 1613,
      "kulmiye": 1614,
      "fog": 1615,
      "kuu": 1616,
      "kaddib": 1617,
      "wasiirada": 1618,
      "cabdiraxmaan": 1619,
      "can": 1620,
      "goor": 1621,
      "xiriirka": 1622,
      "askar": 1623,
      "trum": 1624,
      "xaaji": 1625,
      "ahaayeen": 1626,
      "##te": 1627,
      "gaarka": 1628,
      "xoogga": 1629,
      "nair": 1630,
      "lahay": 1631,
      "sheek": 1632,
      "wey": 1633,
      "haatan": 1634,
      "caan": 1635,
      "rad": 1636,
      "goobta": 1637,
      "all": 1638,
      "kun": 1639,
      "xer": 1640,
      "horta": 1641,
      "##ayl": 1642,
      "##aystay": 1643,
      "eth": 1644,
      "nuur": 1645,
      "000": 1646,
      "yaalla": 1647,
      "saa": 1648,
      "##jinta": 1649,
      "##weynaha": 1650,
      "haween": 1651,
      "sameeyo": 1652,
      "nairobi": 1653,
      "gaari": 1654,
      "wakiil": 1655,
      "ganacsiga": 1656,
      "##kay": 1657,
      "##dar": 1658,
      "##adaan": 1659,
      "qabto": 1660,
      "adduunka": 1661,
      "##deen": 1662,
      "ahi": 1663,
      "heli": 1664,
      "##go": 1665,
      "lama": 1666,
      "horumarinta": 1667,
      "##aarka": 1668,
      "##asha": 1669,
      "##jiyo": 1670,
      "re": 1671,
      "##bi": 1672,
      "gaalkacyo": 1673,
      "##ayaal": 1674,
      "hayadaha": 1675,
      "arin": 1676,
      "islaamka": 1677,
      "dalkaasi": 1678,
      "run": 1679,
      "xidhiidh": 1680,
      "idin": 1681,
      "##bax": 1682,
      "##aadaan": 1683,
      "##tin": 1684,
      "shaqeyn": 1685,
      "masuuliyiinta": 1686,
      "##had": 1687,
      "toos": 1688,
      "fud": 1689,
      "wayn": 1690,
      "magacaab": 1691,
      "##aydha": 1692,
      "##aalo": 1693,
      "dacw": 1694,
      "##cad": 1695,
      "deeq": 1696,
      "helo": 1697,
      "of": 1698,
      "bay": 1699,
      "wac": 1700,
      "cr": 1701,
      "##kari": 1702,
      "daw": 1703,
      "wuu": 1704,
      "##ariis": 1705,
      "##be": 1706,
      "khay": 1707,
      "11": 1708,
      "ibr": 1709,
      "diinta": 1710,
      "may": 1711,
      "imaaraadka": 1712,
      "sir": 1713,
      "muujin": 1714,
      "goboleedka": 1715,
      "##kiis": 1716,
      "ethio": 1717,
      "xud": 1718,
      "askari": 1719,
      "illaa": 1720,
      "laaan": 1721,
      "wadanka": 1722,
      "bin": 1723,
      "mudan": 1724,
      "gash": 1725,
      "12": 1726,
      "cis": 1727,
      "boos": 1728,
      "qas": 1729,
      "musharax": 1730,
      "ans": 1731,
      "baydha": 1732,
      "xay": 1733,
      "teg": 1734,
      "mux": 1735,
      "##ember": 1736,
      "dheg": 1737,
      "hadalka": 1738,
      "##stoo": 1739,
      "xusay": 1740,
      "wadaag": 1741,
      "##taasi": 1742,
      "lix": 1743,
      "gaas": 1744,
      "dag": 1745,
      "en": 1746,
      "saaxiib": 1747,
      "man": 1748,
      "rasmi": 1749,
      "lahayd": 1750,
      "saxiix": 1751,
      "naxariis": 1752,
      "bedel": 1753,
      "kheyre": 1754,
      "gelin": 1755,
      "shirkadda": 1756,
      "safar": 1757,
      "shariif": 1758,
      "dagaalam": 1759,
      "fik": 1760,
      "wali": 1761,
      "saldhig": 1762,
      "tirada": 1763,
      "ganacsa": 1764,
      "##ews": 1765,
      "tagay": 1766,
      "baab": 1767,
      "carabta": 1768,
      "sameyn": 1769,
      "##aaso": 1770,
      "##eysaa": 1771,
      "ahna": 1772,
      "mida": 1773,
      "ilaahay": 1774,
      "haddana": 1775,
      "kartaa": 1776,
      "socon": 1777,
      "##ent": 1778,
      "##eelle": 1779,
      "gobalka": 1780,
      "sab": 1781,
      "madaxa": 1782,
      "waajib": 1783,
      "yeelan": 1784,
      "radio": 1785,
      "waxyaabaha": 1786,
      "kuwaasi": 1787,
      "haweenka": 1788,
      "fudud": 1789,
      "dawlad": 1790,
      "rid": 1791,
      "usoo": 1792,
      "##hel": 1793,
      "##tion": 1794,
      "jireen": 1795,
      "co": 1796,
      "ciidam": 1797,
      "14": 1798,
      "uuna": 1799,
      "df": 1800,
      "##tiij": 1801,
      "##iyiin": 1802,
      "maan": 1803,
      "nas": 1804,
      "ujeed": 1805,
      "##nim": 1806,
      "iskaash": 1807,
      "##aadeen": 1808,
      "miis": 1809,
      "magacaabo": 1810,
      "qoraalka": 1811,
      "##eef": 1812,
      "##tig": 1813,
      "no": 1814,
      "biyo": 1815,
      "bari": 1816,
      "kulmay": 1817,
      "##aadda": 1818,
      "##eec": 1819,
      "dhaca": 1820,
      "doortay": 1821,
      "maalinta": 1822,
      "##uumada": 1823,
      "qarx": 1824,
      "faar": 1825,
      "jirtay": 1826,
      "todob": 1827,
      "ethioia": 1828,
      "##ki": 1829,
      "yeeshay": 1830,
      "##del": 1831,
      "##sadeen": 1832,
      "hirshab": 1833,
      "noqdo": 1834,
      "##aayay": 1835,
      "xafiis": 1836,
      "afhay": 1837,
      "kuna": 1838,
      "dhallin": 1839,
      "musta": 1840,
      "muwaad": 1841,
      "waal": 1842,
      "ogol": 1843,
      "intaa": 1844,
      "xiran": 1845,
      "the": 1846,
      "biyaha": 1847,
      "waaweyn": 1848,
      "kalsoon": 1849,
      "geeska": 1850,
      "##inayaa": 1851,
      "##adar": 1852,
      "##eedu": 1853,
      "18": 1854,
      "##ind": 1855,
      "ganacsi": 1856,
      "milyan": 1857,
      "hooy": 1858,
      "##meen": 1859,
      "taasoo": 1860,
      "uk": 1861,
      "madaxwayn": 1862,
      "##ama": 1863,
      "dhacd": 1864,
      "amar": 1865,
      "karto": 1866,
      "darteed": 1867,
      "ruush": 1868,
      "nolosha": 1869,
      "tel": 1870,
      "noqotay": 1871,
      "daac": 1872,
      "soomal": 1873,
      "sameeyey": 1874,
      "qoray": 1875,
      "ansix": 1876,
      "kana": 1877,
      "berbera": 1878,
      "##yihiin": 1879,
      "banaan": 1880,
      "sannadkii": 1881,
      "waliba": 1882,
      "##kana": 1883,
      "30": 1884,
      "masar": 1885,
      "##iyaa": 1886,
      "mr": 1887,
      "baydhabo": 1888,
      "##ce": 1889,
      "km": 1890,
      "guddi": 1891,
      "degm": 1892,
      "sw": 1893,
      "##du": 1894,
      "siiyo": 1895,
      "##galka": 1896,
      "##ni": 1897,
      "##soor": 1898,
      "xukuumada": 1899,
      "##mail": 1900,
      "##alada": 1901,
      "gobolada": 1902,
      "##addan": 1903,
      "diir": 1904,
      "##adana": 1905,
      "maleesh": 1906,
      "xanuun": 1907,
      "dambeyn": 1908,
      "qiy": 1909,
      "##jiyey": 1910,
      "jooga": 1911,
      "##don": 1912,
      "dhallinyar": 1913,
      "##aaran": 1914,
      "xiray": 1915,
      "saraakiil": 1916,
      "guda": 1917,
      "diiday": 1918,
      "tiro": 1919,
      "tob": 1920,
      "baxday": 1921,
      "hase": 1922,
      "hag": 1923,
      "degaan": 1924,
      "bisha": 1925,
      "bilow": 1926,
      "gaadiidka": 1927,
      "##wax": 1928,
      "qaxoo": 1929,
      "xeeb": 1930,
      "agaasimaha": 1931,
      "ibraah": 1932,
      "qan": 1933,
      "baan": 1934,
      "diin": 1935,
      "khud": 1936,
      "sic": 1937,
      "warq": 1938,
      "aab": 1939,
      "dheeraad": 1940,
      "##lay": 1941,
      "socod": 1942,
      "dhiir": 1943,
      "inoo": 1944,
      "isbit": 1945,
      "arkay": 1946,
      "##oowe": 1947,
      "samayn": 1948,
      "garab": 1949,
      "##oosh": 1950,
      "farx": 1951,
      "horumarka": 1952,
      "dhiib": 1953,
      "iyagu": 1954,
      "##xda": 1955,
      "jeediyay": 1956,
      "xisaab": 1957,
      "ceel": 1958,
      "qaadeen": 1959,
      "##luum": 1960,
      "koowaad": 1961,
      "argagix": 1962,
      "##iisii": 1963,
      "##joog": 1964,
      "garan": 1965,
      "arimaha": 1966,
      "geystay": 1967,
      "se": 1968,
      "xigeen": 1969,
      "toddob": 1970,
      "geeriyooday": 1971,
      "##siy": 1972,
      "ingiriiska": 1973,
      "##iina": 1974,
      "cag": 1975,
      "walaal": 1976,
      "##bada": 1977,
      "qol": 1978,
      "aha": 1979,
      "##kani": 1980,
      "qorshaha": 1981,
      "degaanka": 1982,
      "or": 1983,
      "dadku": 1984,
      "ball": 1985,
      "aniga": 1986,
      "202": 1987,
      "marxuum": 1988,
      "faarax": 1989,
      "dhici": 1990,
      "fah": 1991,
      "sharaf": 1992,
      "##biga": 1993,
      "2017": 1994,
      "horey": 1995,
      "doorasho": 1996,
      "##tood": 1997,
      "inter": 1998,
      "sheegayaan": 1999,
      "##was": 2000,
      "biir": 2001,
      "##uug": 2002,
      "##ihiisa": 2003,
      "ninka": 2004,
      "cilmi": 2005,
      "weerarka": 2006,
      "##eynaa": 2007,
      "jim": 2008,
      "warf": 2009,
      "##igiisa": 2010,
      "badbaad": 2011,
      "jeer": 2012,
      "ba": 2013,
      "dur": 2014,
      "fas": 2015,
      "saartay": 2016,
      "tarta": 2017,
      "yaraan": 2018,
      "tallaab": 2019,
      "tu": 2020,
      "haddaba": 2021,
      "idaacadda": 2022,
      "kaloo": 2023,
      "keliya": 2024,
      "bulsh": 2025,
      "xoogan": 2026,
      "kooxaha": 2027,
      "somaliya": 2028,
      "##oobe": 2029,
      "hayo": 2030,
      "##satay": 2031,
      "olol": 2032,
      "##ton": 2033,
      "tab": 2034,
      "##aday": 2035,
      "##yadii": 2036,
      "buug": 2037,
      "##aatay": 2038,
      "13": 2039,
      "garoowe": 2040,
      "dilka": 2041,
      "lacagta": 2042,
      "istaag": 2043,
      "shid": 2044,
      "##diga": 2045,
      "shiin": 2046,
      "ro": 2047,
      "caw": 2048,
      "daree": 2049,
      "beelaha": 2050,
      "kol": 2051,
      "##aaha": 2052,
      "natiij": 2053,
      "afg": 2054,
      "baad": 2055,
      "taariikhda": 2056,
      "ho": 2057,
      "haya": 2058,
      "##aari": 2059,
      "cudurka": 2060,
      "laf": 2061,
      "wadahad": 2062,
      "kuma": 2063,
      "jeeda": 2064,
      "sacuudiga": 2065,
      "##aadkii": 2066,
      "xoghay": 2067,
      "kaa": 2068,
      "bill": 2069,
      "geed": 2070,
      "naga": 2071,
      "jac": 2072,
      "gurmad": 2073,
      "qabiil": 2074,
      "##ona": 2075,
      "xiriira": 2076,
      "dhexeeya": 2077,
      "gaash": 2078,
      "gargaar": 2079,
      "abaar": 2080,
      "##ooyinkii": 2081,
      "keenay": 2082,
      "##isada": 2083,
      "##aafinta": 2084,
      "hur": 2085,
      "galeen": 2086,
      "##iise": 2087,
      "##raad": 2088,
      "aheyd": 2089,
      "deegaanada": 2090,
      "2016": 2091,
      "baaritaan": 2092,
      "warg": 2093,
      "bilood": 2094,
      "bel": 2095,
      "goobaha": 2096,
      "musuq": 2097,
      "##gad": 2098,
      "dhiig": 2099,
      "dhalinyarada": 2100,
      "aj": 2101,
      "mudd": 2102,
      "darro": 2103,
      "muwaadin": 2104,
      "weyd": 2105,
      "##tahay": 2106,
      "##yaal": 2107,
      "wasaarada": 2108,
      "mo": 2109,
      "gaab": 2110,
      "nahay": 2111,
      "##yaha": 2112,
      "gaadhay": 2113,
      "heshiiska": 2114,
      "talo": 2115,
      "caasimad": 2116,
      "qaraxa": 2117,
      "ruushka": 2118,
      "shaqayn": 2119,
      "mada": 2120,
      "maaliyadda": 2121,
      "##dheer": 2122,
      "##ray": 2123,
      "kulam": 2124,
      "sarkaal": 2125,
      "suuqa": 2126,
      "17": 2127,
      "##laanyo": 2128,
      "eedeeyay": 2129,
      "##idu": 2130,
      "isbed": 2131,
      "##ine": 2132,
      "rum": 2133,
      "##bc": 2134,
      "hind": 2135,
      "warka": 2136,
      "isagu": 2137,
      "barnaamijka": 2138,
      "diiwaan": 2139,
      "muj": 2140,
      "##sadaan": 2141,
      "xasil": 2142,
      "##aabka": 2143,
      "ismaac": 2144,
      "kaasi": 2145,
      "maalintii": 2146,
      "cismaan": 2147,
      "hayaan": 2148,
      "##lar": 2149,
      "sawirro": 2150,
      "inkastoo": 2151,
      "xaas": 2152,
      "arrintan": 2153,
      "med": 2154,
      "socota": 2155,
      "##uuf": 2156,
      "hot": 2157,
      "dawlada": 2158,
      "sool": 2159,
      "shil": 2160,
      "garsoor": 2161,
      "##deg": 2162,
      "siilaanyo": 2163,
      "ahaatee": 2164,
      "qaadi": 2165,
      "dhawaaqay": 2166,
      "##qab": 2167,
      "qalabka": 2168,
      "dim": 2169,
      "dareen": 2170,
      "##war": 2171,
      "afka": 2172,
      "##kaaga": 2173,
      "maalmood": 2174,
      "ged": 2175,
      "weydii": 2176,
      "khilaafka": 2177,
      "idiin": 2178,
      "shur": 2179,
      "xafl": 2180,
      "yeer": 2181,
      "maska": 2182,
      "doonin": 2183,
      "ballan": 2184,
      "ismaaciil": 2185,
      "##alie": 2186,
      "dhibaato": 2187,
      "aaminsan": 2188,
      "taab": 2189,
      "kastaba": 2190,
      "sul": 2191,
      "sub": 2192,
      "ta": 2193,
      "xaqiiq": 2194,
      "degan": 2195,
      "maxay": 2196,
      "duleedka": 2197,
      "waxana": 2198,
      "sun": 2199,
      "wer": 2200,
      "caasimadalie": 2201,
      "gashay": 2202,
      "rasaas": 2203,
      "bariga": 2204,
      "gabadh": 2205,
      "kab": 2206,
      "igu": 2207,
      "rooble": 2208,
      "wado": 2209,
      "cadaal": 2210,
      "gobollada": 2211,
      "xuquuqda": 2212,
      "dhexmar": 2213,
      "tusaale": 2214,
      "ibraahim": 2215,
      "##ruuc": 2216,
      "qaabilsan": 2217,
      "boosaaso": 2218,
      "dhawr": 2219,
      "dhagax": 2220,
      "dalkaas": 2221,
      "##ayaash": 2222,
      "cur": 2223,
      "mucaaradka": 2224,
      "wadajir": 2225,
      "erg": 2226,
      "dhinteen": 2227,
      "waqooyi": 2228,
      "warfaafinta": 2229,
      "##ataa": 2230,
      "daahir": 2231,
      "fid": 2232,
      "mudug": 2233,
      "amaanka": 2234,
      "qatar": 2235,
      "xabsiga": 2236,
      "qabo": 2237,
      "##eena": 2238,
      "##daa": 2239,
      "miisaan": 2240,
      "qud": 2241,
      "##faah": 2242,
      "mashruuc": 2243,
      "##aaya": 2244,
      "##yah": 2245,
      "qaabka": 2246,
      "##niin": 2247,
      "duc": 2248,
      "##ut": 2249,
      "qaybta": 2250,
      "##aynu": 2251,
      "geys": 2252,
      "##eyda": 2253,
      "magaalooyinka": 2254,
      "##ho": 2255,
      "25": 2256,
      "jaamacadda": 2257,
      "##ugu": 2258,
      "madoobe": 2259,
      "madaxweynuhu": 2260,
      "dhacdo": 2261,
      "bilaabay": 2262,
      "boor": 2263,
      "siiyay": 2264,
      "doonayo": 2265,
      "199": 2266,
      "##siyada": 2267,
      "hors": 2268,
      "keentay": 2269,
      "toban": 2270,
      "shirkii": 2271,
      "##tirsan": 2272,
      "min": 2273,
      "caawa": 2274,
      "##keena": 2275,
      "markaa": 2276,
      "reeb": 2277,
      "nidaamka": 2278,
      "afhayeenka": 2279,
      "dhaqaaq": 2280,
      "##oof": 2281,
      "jecel": 2282,
      "16": 2283,
      "fad": 2284,
      "faaf": 2285,
      "##aysal": 2286,
